## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_lambda_function.this[0] has changed
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-SplitFFISSpreadsheet"
      ~ last_modified                  = "2023-05-17T18:14:21.941+0000" -> "2023-05-17T18:14:32.756+0000"
        # (28 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # aws_s3_bucket_notification.grant_source_data will be updated in-place
  ~ resource "aws_s3_bucket_notification" "grant_source_data" {
        id          = "grantsingest-staging-grantssourcedata-357150818708-us-west-2"
        # (2 unchanged attributes hidden)

      ~ lambda_function {
          ~ filter_suffix       = "/grants.gov/extract.xml" -> "/grants.gov/archive.zip"
            id                  = "tf-s3-lambda-20230429025713676700000001"
          ~ lambda_function_arn = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
      ~ lambda_function {
          ~ filter_suffix       = "/ffis/raw.eml" -> "/grants.gov/extract.xml"
            id                  = "tf-s3-lambda-20230429025713676700000002"
          ~ lambda_function_arn = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-EnqueueFFISDownload" -> "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB"
            # (2 unchanged attributes hidden)
        }
      ~ lambda_function {
          ~ filter_suffix       = "/ffis/download.xlsx" -> "/ffis/raw.eml"
            id                  = "tf-s3-lambda-20230517181438939500000003"
          ~ lambda_function_arn = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitFFISSpreadsheet" -> "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-EnqueueFFISDownload"
            # (2 unchanged attributes hidden)
        }
+       lambda_function {
+           events              = [
+               "s3:ObjectCreated:*",
            ]
+           filter_prefix       = "sources/"
+           filter_suffix       = "/ffis/download.xlsx"
+           lambda_function_arn = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitFFISSpreadsheet"
        }
    }

  # datadog_dashboard.service_dashboard[0] will be updated in-place
  ~ resource "datadog_dashboard" "service_dashboard" {
        id                      = "r2k-2tv-mui"
        # (9 unchanged attributes hidden)

+       widget {

+           group_definition {
+               layout_type = "ordered"
+               show_title  = true
+               title       = "ExtractGrantsGovDBToXML"

+               widget {

+                   timeseries_definition {
+                       legend_columns = [
+                           "sum",
                        ]
+                       legend_layout  = "horizontal"
+                       show_legend    = true
+                       title          = "Invocation Status"

+                       request {
+                           display_type = "bars"

+                           formula {
+                               alias              = "Succeeded"
+                               formula_expression = "invoke_success"
                            }
+                           formula {
+                               alias              = "Failed"
+                               formula_expression = "invoke_failure"

+                               style {
+                                   palette       = "warm"
+                                   palette_index = 5
                                }
                            }

+                           query {

+                               metric_query {
+                                   data_source = "metrics"
+                                   name        = "invoke_success"
+                                   query       = "sum:aws.lambda.invocations{$env,$service,$version,handlername:extractgrantsgovdbtoxml}.as_count()"
                                }
                            }
+                           query {

+                               metric_query {
+                                   data_source = "metrics"
+                                   name        = "invoke_failure"
+                                   query       = "sum:aws.lambda.errors{$env,$service,$version,handlername:extractgrantsgovdbtoxml}.as_count()"
                                }
                            }
                        }
                    }
                }
+               widget {

+                   timeseries_definition {
+                       legend_columns = [
+                           "sum",
                        ]
+                       legend_layout  = "horizontal"
+                       show_legend    = true
+                       title          = "Invocation Duration"

+                       request {
+                           display_type = "line"

+                           formula {
+                               alias              = "Duration"
+                               formula_expression = "invoke_duration"
                            }
+                           formula {
+                               alias              = "Timeout"
+                               formula_expression = "invoke_timeout"

+                               style {
+                                   palette       = "warm"
+                                   palette_index = 5
                                }
                            }

+                           query {

+                               metric_query {
+                                   data_source = "metrics"
+                                   name        = "invoke_duration"
+                                   query       = "avg:aws.lambda.duration{$env,$service,$version,handlername:extractgrantsgovdbtoxml}"
                                }
                            }
+                           query {

+                               metric_query {
+                                   data_source = "metrics"
+                                   name        = "invoke_timeout"
+                                   query       = "avg:aws.lambda.timeout{$env,$service,$version,handlername:extractgrantsgovdbtoxml}"
                                }
                            }
                        }
                    }
                }
            }
        }

        # (5 unchanged blocks hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.DownloadGrantsGovDB.source_size"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.DownloadGrantsGovDB.source_size"
-       type            = "gauge" -> null
        # (6 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.created"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.created"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.failed"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.failed"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.data.aws_s3_bucket.download_target will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_s3_bucket" "download_target" {
+       arn                         = (known after apply)
+       bucket                      = "grantsingest-staging-grantssourcedata-357150818708-us-west-2"
+       bucket_domain_name          = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       region                      = (known after apply)
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)
    }

  # module.DownloadFFISSpreadsheet.data.aws_sqs_queue.ffis_downloads will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_sqs_queue" "ffis_downloads" {
+       arn  = (known after apply)
+       id   = (known after apply)
+       name = "ffis_downloads"
+       tags = (known after apply)
+       url  = (known after apply)
    }

  # module.EnqueueFFISDownload.data.aws_s3_bucket.source_data will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_s3_bucket" "source_data" {
+       arn                         = (known after apply)
+       bucket                      = "grantsingest-staging-grantssourcedata-357150818708-us-west-2"
+       bucket_domain_name          = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       region                      = (known after apply)
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)
    }

  # module.EnqueueFFISDownload.data.aws_sqs_queue.ffis_downloads will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_sqs_queue" "ffis_downloads" {
+       arn  = (known after apply)
+       id   = (known after apply)
+       name = "ffis_downloads"
+       tags = (known after apply)
+       url  = (known after apply)
    }

  # module.SplitFFISSpreadsheet.data.aws_s3_bucket.prepared_data will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_s3_bucket" "prepared_data" {
+       arn                         = (known after apply)
+       bucket                      = "grantsingest-staging-grantsprepareddata-357150818708-us-west-2"
+       bucket_domain_name          = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       region                      = (known after apply)
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)
    }

  # module.SplitFFISSpreadsheet.data.aws_s3_bucket.source_data will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_s3_bucket" "source_data" {
+       arn                         = (known after apply)
+       bucket                      = "grantsingest-staging-grantssourcedata-357150818708-us-west-2"
+       bucket_domain_name          = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       region                      = (known after apply)
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)
    }

  # module.grants_prepared_dynamodb_table.aws_dynamodb_table.default[0] will be updated in-place
  ~ resource "aws_dynamodb_table" "default" {
      ~ billing_mode     = "PROVISIONED" -> "PAY_PER_REQUEST"
        id               = "grantsingest-staging-prepareddata"
        name             = "grantsingest-staging-prepareddata"
        tags             = {
            "Name"      = "grantsingest-staging-prepareddata"
            "Namespace" = "grantsingest-staging"
        }
        # (10 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.grants_source_data_bucket.aws_s3_bucket_lifecycle_configuration.default[0] will be updated in-place
  ~ resource "aws_s3_bucket_lifecycle_configuration" "default" {
        id     = "grantsingest-staging-grantssourcedata-357150818708-us-west-2"
        # (1 unchanged attribute hidden)

      ~ rule {
            id     = "rule-1"
            # (1 unchanged attribute hidden)

          ~ filter {
            }

            # (1 unchanged block hidden)
        }
+       rule {
+           id     = "temporary-storage-cleanup"
+           status = "Enabled"

+           abort_incomplete_multipart_upload {
+               days_after_initiation = 1
            }

+           expiration {
+               days = 7
            }

+           filter {
+               prefix = "tmp/"
            }
        }
    }

  # module.DownloadFFISSpreadsheet.module.lambda_execution_policy.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
+       id                        = (known after apply)
+       json                      = (known after apply)
+       override_policy_documents = []
+       source_policy_documents   = [
+           jsonencode(
                {
+                   Statement = [
+                       {
+                           Action   = "secretsmanager:GetSecretValue"
+                           Effect   = "Allow"
+                           Resource = "arn:aws:secretsmanager:us-west-2:357150818708:secret:grants_ingest-staging-datadog_api_key-JGC7E3"
+                           Sid      = "GetDatadogAPIKeySecretValue"
                        },
                    ]
+                   Version   = "2012-10-17"
                }
            ),
        ]

+       statement {
+           actions       = (known after apply)
+           effect        = (known after apply)
+           not_actions   = (known after apply)
+           not_resources = (known after apply)
+           resources     = (known after apply)
+           sid           = (known after apply)

+           condition {
+               test     = (known after apply)
+               values   = (known after apply)
+               variable = (known after apply)
            }

+           not_principals {
+               identifiers = (known after apply)
+               type        = (known after apply)
            }

+           principals {
+               identifiers = (known after apply)
+               type        = (known after apply)
            }
        }
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
+       account_id = (known after apply)
+       arn        = (known after apply)
+       id         = (known after apply)
+       user_id    = (known after apply)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.data.aws_iam_policy_document.assume_role[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "assume_role" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions = [
+               "sts:AssumeRole",
            ]
+           effect  = "Allow"

+           principals {
+               identifiers = [
+                   "lambda.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.data.aws_iam_policy_document.logs[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "logs" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "logs:CreateLogGroup",
+               "logs:CreateLogStream",
+               "logs:PutLogEvents",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:logs:us-west-2:357150818708:log-group:/aws/lambda/grants_ingest-staging-DownloadFFISSpreadsheet:*",
+               "arn:aws:logs:us-west-2:357150818708:log-group:/aws/lambda/grants_ingest-staging-DownloadFFISSpreadsheet:*:*",
            ]
        }
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
+       dns_suffix         = (known after apply)
+       id                 = (known after apply)
+       partition          = (known after apply)
+       reverse_dns_prefix = (known after apply)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
+       description = (known after apply)
+       endpoint    = (known after apply)
+       id          = (known after apply)
+       name        = (known after apply)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.data.external.archive_prepare[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "archive_prepare" {
+       id      = (known after apply)
+       program = [
+           "python3",
+           ".terraform/modules/DownloadFFISSpreadsheet.lambda_function/package.py",
+           "prepare",
        ]
+       query   = {
+           "artifacts_dir"            = "builds"
+           "docker"                   = null
+           "hash_extra"               = ""
+           "hash_extra_paths"         = jsonencode([])
+           "paths"                    = jsonencode(
                {
+                   cwd    = "/home/runner/work/grants-ingest/grants-ingest/terraform"
+                   module = ".terraform/modules/DownloadFFISSpreadsheet.lambda_function"
+                   root   = "."
                }
            )
+           "recreate_missing_package" = "true"
+           "runtime"                  = "provided.al2"
+           "source_path"              = jsonencode(
                [
+                   {
+                       commands = [
+                           "task build-DownloadFFISSpreadsheet",
+                           "cd bin/DownloadFFISSpreadsheet",
+                           ":zip",
                        ]
+                       path     = "./.."
                    },
                ]
            )
        }
+       result  = (known after apply)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_iam_policy.additional_json[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional_json" {
        id        = "arn:aws:iam::357150818708:policy/grants_ingest-staging-DownloadFFISSpreadsheet"
        name      = "grants_ingest-staging-DownloadFFISSpreadsheet"
      ~ policy    = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = "secretsmanager:GetSecretValue"
-                       Effect   = "Allow"
-                       Resource = "arn:aws:secretsmanager:us-west-2:357150818708:secret:grants_ingest-staging-datadog_api_key-JGC7E3"
-                       Sid      = "GetDatadogAPIKeySecretValue"
                    },
-                   {
-                       Action   = "s3:PutObject"
-                       Effect   = "Allow"
-                       Resource = "arn:aws:s3:::grantsingest-staging-grantssourcedata-357150818708-us-west-2/sources/*/*/*/ffis/download.xlsx"
-                       Sid      = "AllowS3DownloadWrite"
                    },
-                   {
-                       Action   = [
-                           "sqs:ReceiveMessage",
-                           "sqs:GetQueueAttributes",
-                           "sqs:DeleteMessage",
                        ]
-                       Effect   = "Allow"
-                       Resource = "arn:aws:sqs:us-west-2:357150818708:ffis_downloads"
-                       Sid      = "AllowSQSGet"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_iam_policy.logs[0] will be updated in-place
  ~ resource "aws_iam_policy" "logs" {
        id        = "arn:aws:iam::357150818708:policy/grants_ingest-staging-DownloadFFISSpreadsheet-logs"
        name      = "grants_ingest-staging-DownloadFFISSpreadsheet-logs"
      ~ policy    = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = [
-                           "logs:PutLogEvents",
-                           "logs:CreateLogStream",
-                           "logs:CreateLogGroup",
                        ]
-                       Effect   = "Allow"
-                       Resource = [
-                           "arn:aws:logs:us-west-2:357150818708:log-group:/aws/lambda/grants_ingest-staging-DownloadFFISSpreadsheet:*:*",
-                           "arn:aws:logs:us-west-2:357150818708:log-group:/aws/lambda/grants_ingest-staging-DownloadFFISSpreadsheet:*",
                        ]
-                       Sid      = ""
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
      ~ assume_role_policy    = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = "sts:AssumeRole"
-                       Effect    = "Allow"
-                       Principal = {
-                           Service = "lambda.amazonaws.com"
                        }
-                       Sid       = ""
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "grants_ingest-staging-DownloadFFISSpreadsheet"
        name                  = "grants_ingest-staging-DownloadFFISSpreadsheet"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_event_source_mapping.this["sqs"] must be replaced
-/+ resource "aws_lambda_event_source_mapping" "this" {
-       bisect_batch_on_function_error     = false -> null
      ~ event_source_arn                   = "arn:aws:sqs:us-west-2:357150818708:ffis_downloads" -> (known after apply) # forces replacement
      ~ function_arn                       = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadFFISSpreadsheet" -> (known after apply)
-       function_response_types            = [] -> null
      ~ id                                 = "ff691eed-bbe3-46e2-8bc6-5d67d8117489" -> (known after apply)
      ~ last_modified                      = "2023-05-08T19:06:57Z" -> (known after apply)
+       last_processing_result             = (known after apply)
      ~ maximum_record_age_in_seconds      = 0 -> (known after apply)
      ~ maximum_retry_attempts             = 0 -> (known after apply)
      ~ parallelization_factor             = 0 -> (known after apply)
-       queues                             = [] -> null
      ~ state                              = "Enabled" -> (known after apply)
      ~ state_transition_reason            = "USER_INITIATED" -> (known after apply)
-       topics                             = [] -> null
-       tumbling_window_in_seconds         = 0 -> null
      ~ uuid                               = "ff691eed-bbe3-46e2-8bc6-5d67d8117489" -> (known after apply)
        # (4 unchanged attributes hidden)

+       amazon_managed_kafka_event_source_config {
+           consumer_group_id = (known after apply)
        }

+       self_managed_kafka_event_source_config {
+           consumer_group_id = (known after apply)
        }
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
-       code_signing_config_arn        = "" -> null
        id                             = "grants_ingest-staging-DownloadFFISSpreadsheet"
-       image_uri                      = "" -> null
-       kms_key_arn                    = "" -> null
      ~ last_modified                  = "2023-05-17T18:14:32.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadFFISSpreadsheet:5" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadFFISSpreadsheet:5/invocations" -> (known after apply)
      ~ s3_key                         = "builds/0b557b5d349ca7c1d891a992d01fbf7c3cbacae5471a3ca0249741e22d121df2.zip" -> (known after apply)
      ~ s3_object_version              = "jQVfrKbgQFmEV9LkdNjTVy6cW3MvKNjc" -> (known after apply)
-       signing_job_arn                = "" -> null
-       signing_profile_version_arn    = "" -> null
      ~ source_code_hash               = "Bxo2rIzIMzhOsQDGbODMmpO/KyLjPYpYWkjaLyqN7lU=" -> (known after apply)
        tags                           = {}
      ~ version                        = "5" -> (known after apply)
        # (17 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
-               "DD_API_KEY_SECRET_ARN"        = (sensitive value)
-               "DD_APM_ENABLED"               = "true"
-               "DD_CAPTURE_LAMBDA_PAYLOAD"    = "true"
-               "DD_ENV"                       = "staging"
-               "DD_SERVERLESS_APPSEC_ENABLED" = "true"
-               "DD_SERVICE"                   = "grants-ingest"
-               "DD_SITE"                      = "datadoghq.com"
-               "DD_TAGS"                      = "git.commit.sha:4ae117b3ebb85fbe6970cdcb77b9277b986b6fb2,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadffisspreadsheet"
-               "DD_TRACE_ENABLED"             = "true"
-               "DD_VERSION"                   = "4ae117b3ebb85fbe6970cdcb77b9277b986b6fb2"
-               "LOG_LEVEL"                    = "INFO"
-               "S3_USE_PATH_STYLE"            = "true"
-               "TARGET_BUCKET_NAME"           = "grantsingest-staging-grantssourcedata-357150818708-us-west-2"
-               "TZ"                           = "UTC"
            } -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_permission.current_version_triggers["SQSQueueNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "SQSQueueNotification" -> (known after apply)
      ~ qualifier           = "5" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "f7f9b68bf5e52f1e7dc5fd494a25bae7-2" -> (known after apply)
      ~ id                     = "builds/0b557b5d349ca7c1d891a992d01fbf7c3cbacae5471a3ca0249741e22d121df2.zip" -> (known after apply)
      ~ key                    = "builds/0b557b5d349ca7c1d891a992d01fbf7c3cbacae5471a3ca0249741e22d121df2.zip" -> (known after apply) # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/0b557b5d349ca7c1d891a992d01fbf7c3cbacae5471a3ca0249741e22d121df2.zip" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "jQVfrKbgQFmEV9LkdNjTVy6cW3MvKNjc" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = (known after apply)
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = (known after apply)
+       id                   = (known after apply)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "4776252375806921031" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/0b557b5d349ca7c1d891a992d01fbf7c3cbacae5471a3ca0249741e22d121df2.zip" -> (known after apply)
          ~ "timestamp" = "1684347246124248000" -> (known after apply)
        }
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "8742265559669484622" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/0b557b5d349ca7c1d891a992d01fbf7c3cbacae5471a3ca0249741e22d121df2.zip" -> (known after apply)
            # (4 unchanged elements hidden)
        }
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-DownloadGrantsGovDB"
      ~ last_modified                  = "2023-05-17T18:14:32.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:30" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:30/invocations" -> (known after apply)
      ~ s3_key                         = "builds/aab06a1237bf723ffaf9c11fab66ddf11729c37a68928274d4a8d0d63921d148.zip" -> "builds/c4c8ea301b16a0bbb8cd98ed4fd8901125f0c982b3f26ea4572e016c5e45dea2.zip"
      ~ s3_object_version              = "6tcscobuSIK2AJW9ahKAJOAxVkzJni6I" -> (known after apply)
        tags                           = {}
      ~ version                        = "30" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                        = "git.commit.sha:4ae117b3ebb85fbe6970cdcb77b9277b986b6fb2,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb" -> "git.commit.sha:9f57d3f7f3421dfb0ee726d09482a4ef58d29552,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb"
              ~ "DD_VERSION"                     = "4ae117b3ebb85fbe6970cdcb77b9277b986b6fb2" -> "9f57d3f7f3421dfb0ee726d09482a4ef58d29552"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_permission.current_version_triggers["Schedule"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "Schedule" -> (known after apply)
      ~ qualifier           = "30" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "5fc833d69aba2a2c7e51a50d63744fce-2" -> (known after apply)
      ~ id                     = "builds/aab06a1237bf723ffaf9c11fab66ddf11729c37a68928274d4a8d0d63921d148.zip" -> (known after apply)
      ~ key                    = "builds/aab06a1237bf723ffaf9c11fab66ddf11729c37a68928274d4a8d0d63921d148.zip" -> "builds/c4c8ea301b16a0bbb8cd98ed4fd8901125f0c982b3f26ea4572e016c5e45dea2.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/aab06a1237bf723ffaf9c11fab66ddf11729c37a68928274d4a8d0d63921d148.zip" -> "builds/c4c8ea301b16a0bbb8cd98ed4fd8901125f0c982b3f26ea4572e016c5e45dea2.zip"
-       tags                   = {} -> null
      ~ version_id             = "6tcscobuSIK2AJW9ahKAJOAxVkzJni6I" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-DownloadGrantsGovDB
                            cd bin/DownloadGrantsGovDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/c4c8ea301b16a0bbb8cd98ed4fd8901125f0c982b3f26ea4572e016c5e45dea2.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/c4c8ea301b16a0bbb8cd98ed4fd8901125f0c982b3f26ea4572e016c5e45dea2.plan.json"
+       id                   = (known after apply)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "6676530190639173753" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/aab06a1237bf723ffaf9c11fab66ddf11729c37a68928274d4a8d0d63921d148.zip" -> "builds/c4c8ea301b16a0bbb8cd98ed4fd8901125f0c982b3f26ea4572e016c5e45dea2.zip"
          ~ "timestamp" = "1684347231147880000" -> "1684976986080725000"
        }
    }

  # module.DownloadGrantsGovDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "7927816354095472385" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/aab06a1237bf723ffaf9c11fab66ddf11729c37a68928274d4a8d0d63921d148.zip" -> "builds/c4c8ea301b16a0bbb8cd98ed4fd8901125f0c982b3f26ea4572e016c5e45dea2.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.EnqueueFFISDownload.module.lambda_execution_policy.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
+       id                        = (known after apply)
+       json                      = (known after apply)
+       override_policy_documents = []
+       source_policy_documents   = [
+           jsonencode(
                {
+                   Statement = [
+                       {
+                           Action   = "secretsmanager:GetSecretValue"
+                           Effect   = "Allow"
+                           Resource = "arn:aws:secretsmanager:us-west-2:357150818708:secret:grants_ingest-staging-datadog_api_key-JGC7E3"
+                           Sid      = "GetDatadogAPIKeySecretValue"
                        },
                    ]
+                   Version   = "2012-10-17"
                }
            ),
        ]

+       statement {
+           actions       = (known after apply)
+           effect        = (known after apply)
+           not_actions   = (known after apply)
+           not_resources = (known after apply)
+           resources     = (known after apply)
+           sid           = (known after apply)

+           condition {
+               test     = (known after apply)
+               values   = (known after apply)
+               variable = (known after apply)
            }

+           not_principals {
+               identifiers = (known after apply)
+               type        = (known after apply)
            }

+           principals {
+               identifiers = (known after apply)
+               type        = (known after apply)
            }
        }
    }

  # module.EnqueueFFISDownload.module.lambda_function.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
+       account_id = (known after apply)
+       arn        = (known after apply)
+       id         = (known after apply)
+       user_id    = (known after apply)
    }

  # module.EnqueueFFISDownload.module.lambda_function.data.aws_iam_policy_document.assume_role[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "assume_role" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions = [
+               "sts:AssumeRole",
            ]
+           effect  = "Allow"

+           principals {
+               identifiers = [
+                   "lambda.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
    }

  # module.EnqueueFFISDownload.module.lambda_function.data.aws_iam_policy_document.logs[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "logs" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "logs:CreateLogGroup",
+               "logs:CreateLogStream",
+               "logs:PutLogEvents",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:logs:us-west-2:357150818708:log-group:/aws/lambda/grants_ingest-staging-EnqueueFFISDownload:*",
+               "arn:aws:logs:us-west-2:357150818708:log-group:/aws/lambda/grants_ingest-staging-EnqueueFFISDownload:*:*",
            ]
        }
    }

  # module.EnqueueFFISDownload.module.lambda_function.data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
+       dns_suffix         = (known after apply)
+       id                 = (known after apply)
+       partition          = (known after apply)
+       reverse_dns_prefix = (known after apply)
    }

  # module.EnqueueFFISDownload.module.lambda_function.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
+       description = (known after apply)
+       endpoint    = (known after apply)
+       id          = (known after apply)
+       name        = (known after apply)
    }

  # module.EnqueueFFISDownload.module.lambda_function.data.external.archive_prepare[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "archive_prepare" {
+       id      = (known after apply)
+       program = [
+           "python3",
+           ".terraform/modules/EnqueueFFISDownload.lambda_function/package.py",
+           "prepare",
        ]
+       query   = {
+           "artifacts_dir"            = "builds"
+           "docker"                   = null
+           "hash_extra"               = ""
+           "hash_extra_paths"         = jsonencode([])
+           "paths"                    = jsonencode(
                {
+                   cwd    = "/home/runner/work/grants-ingest/grants-ingest/terraform"
+                   module = ".terraform/modules/EnqueueFFISDownload.lambda_function"
+                   root   = "."
                }
            )
+           "recreate_missing_package" = "true"
+           "runtime"                  = "provided.al2"
+           "source_path"              = jsonencode(
                [
+                   {
+                       commands = [
+                           "task build-EnqueueFFISDownload",
+                           "cd bin/EnqueueFFISDownload",
+                           ":zip",
                        ]
+                       path     = "./.."
                    },
                ]
            )
        }
+       result  = (known after apply)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_iam_policy.additional_json[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional_json" {
        id        = "arn:aws:iam::357150818708:policy/grants_ingest-staging-EnqueueFFISDownload"
        name      = "grants_ingest-staging-EnqueueFFISDownload"
      ~ policy    = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = "secretsmanager:GetSecretValue"
-                       Effect   = "Allow"
-                       Resource = "arn:aws:secretsmanager:us-west-2:357150818708:secret:grants_ingest-staging-datadog_api_key-JGC7E3"
-                       Sid      = "GetDatadogAPIKeySecretValue"
                    },
-                   {
-                       Action   = "s3:GetObject"
-                       Effect   = "Allow"
-                       Resource = "arn:aws:s3:::grantsingest-staging-grantssourcedata-357150818708-us-west-2/sources/*/*/*/ffis/raw.eml"
-                       Sid      = "AllowS3DownloadSourceData"
                    },
-                   {
-                       Action   = "sqs:SendMessage"
-                       Effect   = "Allow"
-                       Resource = "arn:aws:sqs:us-west-2:357150818708:ffis_downloads"
-                       Sid      = "AllowSQSPublish"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_iam_policy.logs[0] will be updated in-place
  ~ resource "aws_iam_policy" "logs" {
        id        = "arn:aws:iam::357150818708:policy/grants_ingest-staging-EnqueueFFISDownload-logs"
        name      = "grants_ingest-staging-EnqueueFFISDownload-logs"
      ~ policy    = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = [
-                           "logs:PutLogEvents",
-                           "logs:CreateLogStream",
-                           "logs:CreateLogGroup",
                        ]
-                       Effect   = "Allow"
-                       Resource = [
-                           "arn:aws:logs:us-west-2:357150818708:log-group:/aws/lambda/grants_ingest-staging-EnqueueFFISDownload:*:*",
-                           "arn:aws:logs:us-west-2:357150818708:log-group:/aws/lambda/grants_ingest-staging-EnqueueFFISDownload:*",
                        ]
-                       Sid      = ""
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
      ~ assume_role_policy    = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = "sts:AssumeRole"
-                       Effect    = "Allow"
-                       Principal = {
-                           Service = "lambda.amazonaws.com"
                        }
-                       Sid       = ""
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "grants_ingest-staging-EnqueueFFISDownload"
        name                  = "grants_ingest-staging-EnqueueFFISDownload"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
-       code_signing_config_arn        = "" -> null
        id                             = "grants_ingest-staging-EnqueueFFISDownload"
-       image_uri                      = "" -> null
-       kms_key_arn                    = "" -> null
      ~ last_modified                  = "2023-05-17T18:14:32.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-EnqueueFFISDownload:10" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-EnqueueFFISDownload:10/invocations" -> (known after apply)
      ~ s3_key                         = "builds/7191d2938535d91cce2ac865ed8f4c89b85e12151b71cf8118996cda3d38351d.zip" -> (known after apply)
      ~ s3_object_version              = "vfZdZTG5MnhW1iAAldu4oJ_woLaLEMGK" -> (known after apply)
-       signing_job_arn                = "" -> null
-       signing_profile_version_arn    = "" -> null
      ~ source_code_hash               = "jmRcIyB4mvWUCQw2TDaNcbW+1fnqcCkbev4gopMfxxc=" -> (known after apply)
        tags                           = {}
      ~ version                        = "10" -> (known after apply)
        # (17 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
-               "DD_API_KEY_SECRET_ARN"        = (sensitive value)
-               "DD_APM_ENABLED"               = "true"
-               "DD_CAPTURE_LAMBDA_PAYLOAD"    = "true"
-               "DD_ENV"                       = "staging"
-               "DD_SERVERLESS_APPSEC_ENABLED" = "true"
-               "DD_SERVICE"                   = "grants-ingest"
-               "DD_SITE"                      = "datadoghq.com"
-               "DD_TAGS"                      = "git.commit.sha:4ae117b3ebb85fbe6970cdcb77b9277b986b6fb2,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:enqueueffisdownload"
-               "DD_TRACE_ENABLED"             = "true"
-               "DD_VERSION"                   = "4ae117b3ebb85fbe6970cdcb77b9277b986b6fb2"
-               "FFIS_SQS_QUEUE_URL"           = "https://sqs.us-west-2.amazonaws.com/357150818708/ffis_downloads"
-               "LOG_LEVEL"                    = "INFO"
-               "S3_USE_PATH_STYLE"            = "true"
-               "TZ"                           = "UTC"
            } -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "10" -> (known after apply) # forces replacement
      ~ source_arn          = "arn:aws:s3:::grantsingest-staging-grantssourcedata-357150818708-us-west-2" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_permission.unqualified_alias_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "unqualified_alias_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ source_arn          = "arn:aws:s3:::grantsingest-staging-grantssourcedata-357150818708-us-west-2" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "4eb64058eee0f81c37970c8935289987-2" -> (known after apply)
      ~ id                     = "builds/7191d2938535d91cce2ac865ed8f4c89b85e12151b71cf8118996cda3d38351d.zip" -> (known after apply)
      ~ key                    = "builds/7191d2938535d91cce2ac865ed8f4c89b85e12151b71cf8118996cda3d38351d.zip" -> (known after apply) # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/7191d2938535d91cce2ac865ed8f4c89b85e12151b71cf8118996cda3d38351d.zip" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "vfZdZTG5MnhW1iAAldu4oJ_woLaLEMGK" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = (known after apply)
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = (known after apply)
+       id                   = (known after apply)
    }

  # module.EnqueueFFISDownload.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "6710781919779669442" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/7191d2938535d91cce2ac865ed8f4c89b85e12151b71cf8118996cda3d38351d.zip" -> (known after apply)
          ~ "timestamp" = "1684347245811070000" -> (known after apply)
        }
    }

  # module.EnqueueFFISDownload.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "1968986882416639919" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/7191d2938535d91cce2ac865ed8f4c89b85e12151b71cf8118996cda3d38351d.zip" -> (known after apply)
            # (4 unchanged elements hidden)
        }
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "logs:CreateLogGroup",
+               "logs:CreateLogStream",
+               "logs:PutLogEvents",
            ]
+           effect    = "Allow"
+           resources = (known after apply)
        }
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_cloudwatch_log_group.lambda[0] will be created
+   resource "aws_cloudwatch_log_group" "lambda" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       name              = "/aws/lambda/grants_ingest-staging-ExtractGrantsGovDBToXML"
+       name_prefix       = (known after apply)
+       retention_in_days = 30
+       skip_destroy      = false
+       tags_all          = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "grants-ingest"
+           "service"    = "grants-ingest"
+           "usage"      = "workload"
        }
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_iam_policy.additional_json[0] will be created
+   resource "aws_iam_policy" "additional_json" {
+       arn       = (known after apply)
+       id        = (known after apply)
+       name      = "grants_ingest-staging-ExtractGrantsGovDBToXML"
+       path      = "/"
+       policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = "secretsmanager:GetSecretValue"
+                       Effect   = "Allow"
+                       Resource = "arn:aws:secretsmanager:us-west-2:357150818708:secret:grants_ingest-staging-datadog_api_key-JGC7E3"
+                       Sid      = "GetDatadogAPIKeySecretValue"
                    },
+                   {
+                       Action   = "s3:GetObject"
+                       Effect   = "Allow"
+                       Resource = "arn:aws:s3:::grantsingest-staging-grantssourcedata-357150818708-us-west-2/sources/*/*/*/grants.gov/archive.zip"
+                       Sid      = "AllowS3DownloadSourceData"
                    },
+                   {
+                       Action   = [
+                           "s3:PutObject",
+                           "s3:GetObjectTagging",
+                           "s3:GetObject",
+                           "s3:DeleteObject",
                        ]
+                       Effect   = "Allow"
+                       Resource = "arn:aws:s3:::grantsingest-staging-grantssourcedata-357150818708-us-west-2/tmp/sources/*/*/*/grants.gov/extract.xml"
+                       Sid      = "AllowS3UploadAndMoveTemporaryData"
                    },
+                   {
+                       Action   = [
+                           "s3:PutObjectTagging",
+                           "s3:PutObject",
                        ]
+                       Effect   = "Allow"
+                       Resource = "arn:aws:s3:::grantsingest-staging-grantssourcedata-357150818708-us-west-2/sources/*/*/*/grants.gov/extract.xml"
+                       Sid      = "AllowS3UploadSourceData"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id = (known after apply)
+       tags_all  = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "grants-ingest"
+           "service"    = "grants-ingest"
+           "usage"      = "workload"
        }
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_iam_policy.logs[0] will be created
+   resource "aws_iam_policy" "logs" {
+       arn       = (known after apply)
+       id        = (known after apply)
+       name      = "grants_ingest-staging-ExtractGrantsGovDBToXML-logs"
+       path      = "/"
+       policy    = (known after apply)
+       policy_id = (known after apply)
+       tags_all  = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "grants-ingest"
+           "service"    = "grants-ingest"
+           "usage"      = "workload"
        }
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_iam_role.lambda[0] will be created
+   resource "aws_iam_role" "lambda" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "lambda.amazonaws.com"
                        }
+                       Sid       = ""
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = true
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "grants_ingest-staging-ExtractGrantsGovDBToXML"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       permissions_boundary  = "arn:aws:iam::357150818708:policy/service-management-boundary"
+       tags_all              = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "grants-ingest"
+           "service"    = "grants-ingest"
+           "usage"      = "workload"
        }
+       unique_id             = (known after apply)

+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_iam_role_policy_attachment.additional_json[0] will be created
+   resource "aws_iam_role_policy_attachment" "additional_json" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "grants_ingest-staging-ExtractGrantsGovDBToXML"
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_iam_role_policy_attachment.logs[0] will be created
+   resource "aws_iam_role_policy_attachment" "logs" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "grants_ingest-staging-ExtractGrantsGovDBToXML"
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_lambda_function.this[0] will be created
+   resource "aws_lambda_function" "this" {
+       architectures                  = [
+           "arm64",
        ]
+       arn                            = (known after apply)
+       description                    = "Creates an extracted XML from the grants database archive."
+       function_name                  = "grants_ingest-staging-ExtractGrantsGovDBToXML"
+       handler                        = "bootstrap"
+       id                             = (known after apply)
+       invoke_arn                     = (known after apply)
+       last_modified                  = (known after apply)
+       layers                         = [
+           "arn:aws:lambda:us-west-2:464622532012:layer:Datadog-Extension-ARM:41",
        ]
+       memory_size                    = 256
+       package_type                   = "Zip"
+       publish                        = true
+       qualified_arn                  = (known after apply)
+       qualified_invoke_arn           = (known after apply)
+       reserved_concurrent_executions = -1
+       role                           = (known after apply)
+       runtime                        = "provided.al2"
+       s3_bucket                      = "grantsingest-staging-lambdaartifacts-357150818708-us-west-2"
+       s3_key                         = "builds/a54f4bee44a1d037f91009f1e1ecaa015faac9b9aeffd99bd5d07bfa10e6d8a2.zip"
+       s3_object_version              = (known after apply)
+       signing_job_arn                = (known after apply)
+       signing_profile_version_arn    = (known after apply)
+       source_code_hash               = (known after apply)
+       source_code_size               = (known after apply)
+       tags_all                       = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "grants-ingest"
+           "service"    = "grants-ingest"
+           "usage"      = "workload"
        }
+       timeout                        = 300
+       version                        = (known after apply)

+       environment {
+           variables = {
+               "DD_API_KEY_SECRET_ARN"        = (sensitive value)
+               "DD_APM_ENABLED"               = "true"
+               "DD_CAPTURE_LAMBDA_PAYLOAD"    = "true"
+               "DD_ENV"                       = "staging"
+               "DD_SERVERLESS_APPSEC_ENABLED" = "true"
+               "DD_SERVICE"                   = "grants-ingest"
+               "DD_SITE"                      = "datadoghq.com"
+               "DD_TAGS"                      = "git.commit.sha:9f57d3f7f3421dfb0ee726d09482a4ef58d29552,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:extractgrantsgovdbtoxml"
+               "DD_TRACE_ENABLED"             = "true"
+               "DD_VERSION"                   = "9f57d3f7f3421dfb0ee726d09482a4ef58d29552"
+               "LOG_LEVEL"                    = "INFO"
+               "TMP_KEY_PATH_PREFIX"          = "tmp"
+               "TZ"                           = "UTC"
            }
        }

+       ephemeral_storage {
+           size = 512
        }

+       tracing_config {
+           mode = (known after apply)
        }
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] will be created
+   resource "aws_lambda_permission" "current_version_triggers" {
+       action              = "lambda:InvokeFunction"
+       function_name       = "grants_ingest-staging-ExtractGrantsGovDBToXML"
+       id                  = (known after apply)
+       principal           = "s3.amazonaws.com"
+       qualifier           = (known after apply)
+       source_arn          = "arn:aws:s3:::grantsingest-staging-grantssourcedata-357150818708-us-west-2"
+       statement_id        = "S3BucketNotification"
+       statement_id_prefix = (known after apply)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_lambda_permission.unqualified_alias_triggers["S3BucketNotification"] will be created
+   resource "aws_lambda_permission" "unqualified_alias_triggers" {
+       action              = "lambda:InvokeFunction"
+       function_name       = "grants_ingest-staging-ExtractGrantsGovDBToXML"
+       id                  = (known after apply)
+       principal           = "s3.amazonaws.com"
+       source_arn          = "arn:aws:s3:::grantsingest-staging-grantssourcedata-357150818708-us-west-2"
+       statement_id        = "S3BucketNotification"
+       statement_id_prefix = (known after apply)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_s3_object.lambda_package[0] will be created
+   resource "aws_s3_object" "lambda_package" {
+       acl                    = "private"
+       bucket                 = "grantsingest-staging-lambdaartifacts-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       content_type           = (known after apply)
+       etag                   = (known after apply)
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "builds/a54f4bee44a1d037f91009f1e1ecaa015faac9b9aeffd99bd5d07bfa10e6d8a2.zip"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "builds/a54f4bee44a1d037f91009f1e1ecaa015faac9b9aeffd99bd5d07bfa10e6d8a2.zip"
+       storage_class          = "ONEZONE_IA"
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "grants-ingest"
+           "service"    = "grants-ingest"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-ExtractGrantsGovDBToXML
                            cd bin/ExtractGrantsGovDBToXML
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/a54f4bee44a1d037f91009f1e1ecaa015faac9b9aeffd99bd5d07bfa10e6d8a2.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/a54f4bee44a1d037f91009f1e1ecaa015faac9b9aeffd99bd5d07bfa10e6d8a2.plan.json"
+       id                   = (known after apply)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.null_resource.archive[0] will be created
+   resource "null_resource" "archive" {
+       id       = (known after apply)
+       triggers = {
+           "filename"  = "builds/a54f4bee44a1d037f91009f1e1ecaa015faac9b9aeffd99bd5d07bfa10e6d8a2.zip"
+           "timestamp" = "1684976986155837000"
        }
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] will be created
+   resource "null_resource" "sam_metadata_aws_lambda_function" {
+       id       = (known after apply)
+       triggers = {
+           "built_output_path"    = "builds/a54f4bee44a1d037f91009f1e1ecaa015faac9b9aeffd99bd5d07bfa10e6d8a2.zip"
+           "original_source_code" = jsonencode(
                [
+                   {
+                       commands = [
+                           "task build-ExtractGrantsGovDBToXML",
+                           "cd bin/ExtractGrantsGovDBToXML",
+                           ":zip",
                        ]
+                       path     = "./.."
                    },
                ]
            )
+           "resource_name"        = "aws_lambda_function.this[0]"
+           "resource_type"        = "ZIP_LAMBDA_FUNCTION"
+           "source_code_property" = "path"
        }
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-PersistGrantsGovXMLDB"
      ~ last_modified                  = "2023-05-17T18:14:31.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-PersistGrantsGovXMLDB:2" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-PersistGrantsGovXMLDB:2/invocations" -> (known after apply)
      ~ s3_key                         = "builds/c0f54c061f743c82e1d5128abafee2bcdd17ba8581f0caf93c70bf584632cd6b.zip" -> "builds/dd9474d5c7388351255c574077916f78216392672fb3c722e64511991a873327.zip"
      ~ s3_object_version              = "XDA3YeUkPXCfUF6g7UzT3kuRMNgifkh2" -> (known after apply)
        tags                           = {}
      ~ version                        = "2" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                       = "git.commit.sha:4ae117b3ebb85fbe6970cdcb77b9277b986b6fb2,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistgrantsgovxmldb" -> "git.commit.sha:9f57d3f7f3421dfb0ee726d09482a4ef58d29552,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistgrantsgovxmldb"
              ~ "DD_VERSION"                    = "4ae117b3ebb85fbe6970cdcb77b9277b986b6fb2" -> "9f57d3f7f3421dfb0ee726d09482a4ef58d29552"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "2" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "4708bdd2599b96e933d832dfbebcd065-2" -> (known after apply)
      ~ id                     = "builds/c0f54c061f743c82e1d5128abafee2bcdd17ba8581f0caf93c70bf584632cd6b.zip" -> (known after apply)
      ~ key                    = "builds/c0f54c061f743c82e1d5128abafee2bcdd17ba8581f0caf93c70bf584632cd6b.zip" -> "builds/dd9474d5c7388351255c574077916f78216392672fb3c722e64511991a873327.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/c0f54c061f743c82e1d5128abafee2bcdd17ba8581f0caf93c70bf584632cd6b.zip" -> "builds/dd9474d5c7388351255c574077916f78216392672fb3c722e64511991a873327.zip"
-       tags                   = {} -> null
      ~ version_id             = "XDA3YeUkPXCfUF6g7UzT3kuRMNgifkh2" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-PersistGrantsGovXMLDB
                            cd bin/PersistGrantsGovXMLDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/dd9474d5c7388351255c574077916f78216392672fb3c722e64511991a873327.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/dd9474d5c7388351255c574077916f78216392672fb3c722e64511991a873327.plan.json"
+       id                   = (known after apply)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "4297177788337943182" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/c0f54c061f743c82e1d5128abafee2bcdd17ba8581f0caf93c70bf584632cd6b.zip" -> "builds/dd9474d5c7388351255c574077916f78216392672fb3c722e64511991a873327.zip"
          ~ "timestamp" = "1684347231545533800" -> "1684976986001138000"
        }
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "4333883582883632595" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/c0f54c061f743c82e1d5128abafee2bcdd17ba8581f0caf93c70bf584632cd6b.zip" -> "builds/dd9474d5c7388351255c574077916f78216392672fb3c722e64511991a873327.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.SplitFFISSpreadsheet.module.lambda_execution_policy.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
+       id                        = (known after apply)
+       json                      = (known after apply)
+       override_policy_documents = []
+       source_policy_documents   = [
+           jsonencode(
                {
+                   Statement = [
+                       {
+                           Action   = "secretsmanager:GetSecretValue"
+                           Effect   = "Allow"
+                           Resource = "arn:aws:secretsmanager:us-west-2:357150818708:secret:grants_ingest-staging-datadog_api_key-JGC7E3"
+                           Sid      = "GetDatadogAPIKeySecretValue"
                        },
                    ]
+                   Version   = "2012-10-17"
                }
            ),
        ]

+       statement {
+           actions       = (known after apply)
+           effect        = (known after apply)
+           not_actions   = (known after apply)
+           not_resources = (known after apply)
+           resources     = (known after apply)
+           sid           = (known after apply)

+           condition {
+               test     = (known after apply)
+               values   = (known after apply)
+               variable = (known after apply)
            }

+           not_principals {
+               identifiers = (known after apply)
+               type        = (known after apply)
            }

+           principals {
+               identifiers = (known after apply)
+               type        = (known after apply)
            }
        }
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
+       account_id = (known after apply)
+       arn        = (known after apply)
+       id         = (known after apply)
+       user_id    = (known after apply)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.data.aws_iam_policy_document.assume_role[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "assume_role" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions = [
+               "sts:AssumeRole",
            ]
+           effect  = "Allow"

+           principals {
+               identifiers = [
+                   "lambda.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.data.aws_iam_policy_document.logs[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "logs" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "logs:CreateLogGroup",
+               "logs:CreateLogStream",
+               "logs:PutLogEvents",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:logs:us-west-2:357150818708:log-group:/aws/lambda/grants_ingest-staging-SplitFFISSpreadsheet:*",
+               "arn:aws:logs:us-west-2:357150818708:log-group:/aws/lambda/grants_ingest-staging-SplitFFISSpreadsheet:*:*",
            ]
        }
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
+       dns_suffix         = (known after apply)
+       id                 = (known after apply)
+       partition          = (known after apply)
+       reverse_dns_prefix = (known after apply)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
+       description = (known after apply)
+       endpoint    = (known after apply)
+       id          = (known after apply)
+       name        = (known after apply)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.data.external.archive_prepare[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "archive_prepare" {
+       id      = (known after apply)
+       program = [
+           "python3",
+           ".terraform/modules/SplitFFISSpreadsheet.lambda_function/package.py",
+           "prepare",
        ]
+       query   = {
+           "artifacts_dir"            = "builds"
+           "docker"                   = null
+           "hash_extra"               = ""
+           "hash_extra_paths"         = jsonencode([])
+           "paths"                    = jsonencode(
                {
+                   cwd    = "/home/runner/work/grants-ingest/grants-ingest/terraform"
+                   module = ".terraform/modules/SplitFFISSpreadsheet.lambda_function"
+                   root   = "."
                }
            )
+           "recreate_missing_package" = "true"
+           "runtime"                  = "provided.al2"
+           "source_path"              = jsonencode(
                [
+                   {
+                       commands = [
+                           "task build-SplitFFISSpreadsheet",
+                           "cd bin/SplitFFISSpreadsheet",
+                           ":zip",
                        ]
+                       path     = "./.."
                    },
                ]
            )
        }
+       result  = (known after apply)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_iam_policy.additional_json[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional_json" {
        id        = "arn:aws:iam::357150818708:policy/grants_ingest-staging-SplitFFISSpreadsheet"
        name      = "grants_ingest-staging-SplitFFISSpreadsheet"
      ~ policy    = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = "secretsmanager:GetSecretValue"
-                       Effect   = "Allow"
-                       Resource = "arn:aws:secretsmanager:us-west-2:357150818708:secret:grants_ingest-staging-datadog_api_key-JGC7E3"
-                       Sid      = "GetDatadogAPIKeySecretValue"
                    },
-                   {
-                       Action   = [
-                           "s3:ListBucket",
-                           "s3:GetObject",
                        ]
-                       Effect   = "Allow"
-                       Resource = [
-                           "arn:aws:s3:::grantsingest-staging-grantsprepareddata-357150818708-us-west-2/*/*/ffis.org/v1.json",
-                           "arn:aws:s3:::grantsingest-staging-grantsprepareddata-357150818708-us-west-2",
                        ]
-                       Sid      = "AllowInspectS3PreparedData"
                    },
-                   {
-                       Action   = "s3:GetObject"
-                       Effect   = "Allow"
-                       Resource = "arn:aws:s3:::grantsingest-staging-grantssourcedata-357150818708-us-west-2/sources/*/*/*/ffis/download.xlsx"
-                       Sid      = "AllowS3DownloadSourceData"
                    },
-                   {
-                       Action   = "s3:PutObject"
-                       Effect   = "Allow"
-                       Resource = "arn:aws:s3:::grantsingest-staging-grantsprepareddata-357150818708-us-west-2/*/*/ffis.org/v1.json"
-                       Sid      = "AllowS3UploadPreparedData"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_iam_policy.logs[0] will be updated in-place
  ~ resource "aws_iam_policy" "logs" {
        id        = "arn:aws:iam::357150818708:policy/grants_ingest-staging-SplitFFISSpreadsheet-logs"
        name      = "grants_ingest-staging-SplitFFISSpreadsheet-logs"
      ~ policy    = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = [
-                           "logs:PutLogEvents",
-                           "logs:CreateLogStream",
-                           "logs:CreateLogGroup",
                        ]
-                       Effect   = "Allow"
-                       Resource = [
-                           "arn:aws:logs:us-west-2:357150818708:log-group:/aws/lambda/grants_ingest-staging-SplitFFISSpreadsheet:*:*",
-                           "arn:aws:logs:us-west-2:357150818708:log-group:/aws/lambda/grants_ingest-staging-SplitFFISSpreadsheet:*",
                        ]
-                       Sid      = ""
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
      ~ assume_role_policy    = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = "sts:AssumeRole"
-                       Effect    = "Allow"
-                       Principal = {
-                           Service = "lambda.amazonaws.com"
                        }
-                       Sid       = ""
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "grants_ingest-staging-SplitFFISSpreadsheet"
        name                  = "grants_ingest-staging-SplitFFISSpreadsheet"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
-       code_signing_config_arn        = "" -> null
        id                             = "grants_ingest-staging-SplitFFISSpreadsheet"
-       image_uri                      = "" -> null
-       kms_key_arn                    = "" -> null
      ~ last_modified                  = "2023-05-17T18:14:32.756+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitFFISSpreadsheet:1" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitFFISSpreadsheet:1/invocations" -> (known after apply)
      ~ s3_key                         = "builds/c8ac51d9db55e5fbceab9425ddef83a3c935b7cf4c6ef27af0253ca7a276f928.zip" -> (known after apply)
      ~ s3_object_version              = "bWkREmGmpBWgugLcTMAfepaIA0aCX5bk" -> (known after apply)
-       signing_job_arn                = "" -> null
-       signing_profile_version_arn    = "" -> null
      ~ source_code_hash               = "dfqU9EX7BMm/1thuwrbpGeqUqAzfS8hBNohAnLd3wWE=" -> (known after apply)
        tags                           = {}
      ~ version                        = "1" -> (known after apply)
        # (17 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
-               "DD_API_KEY_SECRET_ARN"            = (sensitive value)
-               "DD_APM_ENABLED"                   = "true"
-               "DD_CAPTURE_LAMBDA_PAYLOAD"        = "true"
-               "DD_ENV"                           = "staging"
-               "DD_SERVERLESS_APPSEC_ENABLED"     = "true"
-               "DD_SERVICE"                       = "grants-ingest"
-               "DD_SITE"                          = "datadoghq.com"
-               "DD_TAGS"                          = "git.commit.sha:4ae117b3ebb85fbe6970cdcb77b9277b986b6fb2,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitffisspreadsheet"
-               "DD_TRACE_ENABLED"                 = "true"
-               "DD_TRACE_RATE_LIMIT"              = "1000"
-               "DD_VERSION"                       = "4ae117b3ebb85fbe6970cdcb77b9277b986b6fb2"
-               "DOWNLOAD_CHUNK_LIMIT"             = "20"
-               "GRANTS_PREPARED_DATA_BUCKET_NAME" = "grantsingest-staging-grantsprepareddata-357150818708-us-west-2"
-               "LOG_LEVEL"                        = "INFO"
-               "MAX_CONCURRENT_UPLOADS"           = "10"
-               "S3_USE_PATH_STYLE"                = "true"
-               "TZ"                               = "UTC"
            } -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "1" -> (known after apply) # forces replacement
      ~ source_arn          = "arn:aws:s3:::grantsingest-staging-grantssourcedata-357150818708-us-west-2" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_lambda_permission.unqualified_alias_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "unqualified_alias_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ source_arn          = "arn:aws:s3:::grantsingest-staging-grantssourcedata-357150818708-us-west-2" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "b9c969570fc00fb01f4d273400218ba2-2" -> (known after apply)
      ~ id                     = "builds/c8ac51d9db55e5fbceab9425ddef83a3c935b7cf4c6ef27af0253ca7a276f928.zip" -> (known after apply)
      ~ key                    = "builds/c8ac51d9db55e5fbceab9425ddef83a3c935b7cf4c6ef27af0253ca7a276f928.zip" -> (known after apply) # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/c8ac51d9db55e5fbceab9425ddef83a3c935b7cf4c6ef27af0253ca7a276f928.zip" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "bWkREmGmpBWgugLcTMAfepaIA0aCX5bk" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = (known after apply)
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = (known after apply)
+       id                   = (known after apply)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "1702472389642695330" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/c8ac51d9db55e5fbceab9425ddef83a3c935b7cf4c6ef27af0253ca7a276f928.zip" -> (known after apply)
          ~ "timestamp" = "1684347246036037000" -> (known after apply)
        }
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "8594456788679283433" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/c8ac51d9db55e5fbceab9425ddef83a3c935b7cf4c6ef27af0253ca7a276f928.zip" -> (known after apply)
            # (4 unchanged elements hidden)
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-SplitGrantsGovXMLDB"
      ~ last_modified                  = "2023-05-17T18:14:32.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB:29" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB:29/invocations" -> (known after apply)
      ~ s3_key                         = "builds/906103ba906f09bf20571ac71444a8b31ba6bcfa496ef8aca7f9c589c5d4bd94.zip" -> "builds/7a3542b7ad31fe95033dd2cfb577b864ed61bf62ddac74a811d2d395df34bfe5.zip"
      ~ s3_object_version              = "_S2Y1w4Fb_GDbBfGKA5QtxGnPuGkR9B7" -> (known after apply)
        tags                           = {}
      ~ version                        = "29" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                          = "git.commit.sha:4ae117b3ebb85fbe6970cdcb77b9277b986b6fb2,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb" -> "git.commit.sha:9f57d3f7f3421dfb0ee726d09482a4ef58d29552,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb"
              ~ "DD_VERSION"                       = "4ae117b3ebb85fbe6970cdcb77b9277b986b6fb2" -> "9f57d3f7f3421dfb0ee726d09482a4ef58d29552"
                # (15 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "29" -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "6da278487e2c990f0f5590d14c19f0b5-2" -> (known after apply)
      ~ id                     = "builds/906103ba906f09bf20571ac71444a8b31ba6bcfa496ef8aca7f9c589c5d4bd94.zip" -> (known after apply)
      ~ key                    = "builds/906103ba906f09bf20571ac71444a8b31ba6bcfa496ef8aca7f9c589c5d4bd94.zip" -> "builds/7a3542b7ad31fe95033dd2cfb577b864ed61bf62ddac74a811d2d395df34bfe5.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/906103ba906f09bf20571ac71444a8b31ba6bcfa496ef8aca7f9c589c5d4bd94.zip" -> "builds/7a3542b7ad31fe95033dd2cfb577b864ed61bf62ddac74a811d2d395df34bfe5.zip"
-       tags                   = {} -> null
      ~ version_id             = "_S2Y1w4Fb_GDbBfGKA5QtxGnPuGkR9B7" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-SplitGrantsGovXMLDB
                            cd bin/SplitGrantsGovXMLDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/7a3542b7ad31fe95033dd2cfb577b864ed61bf62ddac74a811d2d395df34bfe5.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/7a3542b7ad31fe95033dd2cfb577b864ed61bf62ddac74a811d2d395df34bfe5.plan.json"
+       id                   = (known after apply)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "6510708396552226738" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/906103ba906f09bf20571ac71444a8b31ba6bcfa496ef8aca7f9c589c5d4bd94.zip" -> "builds/7a3542b7ad31fe95033dd2cfb577b864ed61bf62ddac74a811d2d395df34bfe5.zip"
          ~ "timestamp" = "1684347231105198000" -> "1684976986162862000"
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "6431754708076394916" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/906103ba906f09bf20571ac71444a8b31ba6bcfa496ef8aca7f9c589c5d4bd94.zip" -> "builds/7a3542b7ad31fe95033dd2cfb577b864ed61bf62ddac74a811d2d395df34bfe5.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 46 to add, 24 to change, 27 to destroy.

Changes to Outputs:
  ~ lambda_functions = [
        # (3 unchanged elements hidden)
        "grants_ingest-staging-DownloadFFISSpreadsheet",
+       "grants_ingest-staging-ExtractGrantsGovDBToXML",
    ]
```

</details>

*Pusher: @TylerHendrickson, Action: `pull_request`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/grants-ingest/actions/runs/5074971556)*